In [4]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in d:\anaconda\lib\site-packages (2.2.2)
Requirement already satisfied: numpy>=1.26.0 in d:\anaconda\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in d:\anaconda\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in d:\anaconda\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.7 in d:\anaconda\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in d:\anaconda\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [5]:
import pandas as pd

In [6]:
data = pd.Series([1,2,3,4])

In [7]:
data

0    1
1    2
2    3
3    4
dtype: int64

In [8]:
data = pd.Series([1,2,3,4], index = (['a','b','c','d']))

In [9]:
data

a    1
b    2
c    3
d    4
dtype: int64

In [10]:
indx = (['c','d','e'])
lst = ([1,2,3])

In [11]:
data1 = pd.Series(data = lst , index = indx)
data1

c    1
d    2
e    3
dtype: int64

In [13]:
df = pd.read_excel('data.xlsx')

In [14]:
df

    1   2   3   4   5
0   2   4   6   8  10
1   3   6   9  12  15
2   4   8  12  16  20
3   5  10  15  20  25
4   6  12  18  24  30
5   7  14  21  28  35
6   8  16  24  32  40
7   9  18  27  36  45
8  10  20  30  40  50

Analyze the data

In [15]:
df.head()

   1   2   3   4   5
0  2   4   6   8  10
1  3   6   9  12  15
2  4   8  12  16  20
3  5  10  15  20  25
4  6  12  18  24  30

In [16]:
df.tail()

    1   2   3   4   5
4   6  12  18  24  30
5   7  14  21  28  35
6   8  16  24  32  40
7   9  18  27  36  45
8  10  20  30  40  50

In [18]:
df = pd.read_excel('data.xlsx')

In [20]:
df['Colour']

0     Blue
1    Black
2      Red
3    Black
4    black
5     Blue
6      Red
7      Red
8      Red
Name: Colour, dtype: object

In [21]:
type(df['Colour'])

pandas.core.series.Series

In [22]:
df.tail()

   S no Colour     Font  Sales Article
4     5  black  Georgia      2     Top
5     6   Blue  Georgia      1  Tshirt
6     7    Red  Calibir      3     top
7     8    Red    Ariel      1  Tshirt
8     9    Red    Ariel      2  Tshirt

In [23]:
df.shape

(9, 5)

In [24]:
df.info

<bound method DataFrame.info of    S no Colour     Font  Sales Article
0     1   Blue    Ariel      2   Shirt
1     2  Black  Calibir      3  Tshirt
2     3    Red  Georgia      1     Top
3     4  Black  Calibir      3   Shirt
4     5  black  Georgia      2     Top
5     6   Blue  Georgia      1  Tshirt
6     7    Red  Calibir      3     top
7     8    Red    Ariel      1  Tshirt
8     9    Red    Ariel      2  Tshirt>

In [25]:
df.describe()

           S no     Sales
count  9.000000  9.000000
mean   5.000000  2.000000
std    2.738613  0.866025
min    1.000000  1.000000
25%    3.000000  1.000000
50%    5.000000  2.000000
75%    7.000000  3.000000
max    9.000000  3.000000

In [26]:
df.describe().transpose()

       count  mean       std  min  25%  50%  75%  max
S no     9.0   5.0  2.738613  1.0  3.0  5.0  7.0  9.0
Sales    9.0   2.0  0.866025  1.0  1.0  2.0  3.0  3.0

In [27]:
df['Colour'].nunique()

4

In [28]:
df['Sales'].sum()

18

In [29]:
df.index

RangeIndex(start=0, stop=9, step=1)

In [ ]:
df